Revit 2027 API
BuiltInFailures.LegendFailures.LegendComponentNotVisible Property
 The component you have selected is not visible in the selected view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LegendComponentNotVisible { get; }
Public Shared ReadOnly Property LegendComponentNotVisible As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LegendComponentNotVisible {
	FailureDefinitionId^ get ();
}
static member LegendComponentNotVisible : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LegendFailures Class
Autodesk.Revit.DB Namespace